{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report mapping new gallery-related features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/DEPLOYMENT.md": "Detailed instructions for local and mainnet deployment using dfx, pnpm, and optional automation script.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode values, and global styling rules.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/scripts/publish-ic.sh": "Bash script that builds and deploys backend and frontend canisters to local or IC networks with status output.",
  "frontend/src/App.tsx": "Root React component composing header, sections, and footer into the full single‑page layout.",
  "frontend/src/components/site/ContactSection.tsx": "Contact section rendering phone, email, location, and hours cards along with a call‑to‑action card.",
  "frontend/src/components/site/Footer.tsx": "Renders the site footer with company info, quick links, services list, and contact details using smooth-scroll navigation.",
  "frontend/src/components/site/Header.tsx": "Implements a responsive header with logo, navigation links, and mobile menu supporting smooth section scrolling.",
  "frontend/src/components/site/HeroSection.tsx": "Displays the main hero section with background image, tagline, stats, and buttons that scroll to contact or services.",
  "frontend/src/components/site/ProjectGallerySection.tsx": "Shows a grid of project images with titles and a modal preview that opens on click.",
  "frontend/src/components/site/ServicesSection.tsx": "Lists construction-related services in card format with icons, descriptions, and feature bullets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for handling Internet Identity authentication, including loading, login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query logic is required.",
  "frontend/src/index.css": "Defines Tailwind base styles plus custom color variables, typography, and background styling for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, fonts, animations, and container settings using theme CSS variables.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variable loading, alias setup, build settings, and a dev server proxy.",
  "project_state.json": "Describes the project’s state, goals, requirements, and needed image assets for a Hindi-language construction company website."
}