{
  "backend/main.mo": "Implements user profiles and smartwatch dataset storage with access‑controlled CRUD and filtering queries.",
  "feature_evidence.json": "Lists feature definitions, related files, components, and test IDs for the smartwatch data application.",
  "frontend-file-summaries.txt": "Contains prewritten 1–2 sentence summaries for all frontend files.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing local and mainnet IC setup, build steps, troubleshooting, and verification.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode variables, and global theming.",
  "frontend/index.html": "Minimal HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/scripts/publish-ic.sh": "Automated script that builds and deploys backend and frontend canisters to local or IC networks.",
  "frontend/src/App.tsx": "Main app sets up React Query, auth gating, profile setup, and navigation between import, dashboard, datasets, and dataset details views.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen prompting users to authenticate via Internet Identity and showing feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Form for first‑time users to submit a profile name and save it via mutation with basic validation and error handling.",
  "frontend/src/components/site/ContactSection.tsx": "Empty placeholder component.",
  "frontend/src/components/site/Footer.tsx": "Footer displaying app branding, feature list, privacy notes, and a referral link with dynamic year and hostname.",
  "frontend/src/components/site/Header.tsx": "Header providing navigation, branding, and login/logout controls with desktop and mobile layouts.",
  "frontend/src/components/site/HeroSection.tsx": "Empty placeholder component.",
  "frontend/src/components/site/ProjectGallerySection.tsx": "Empty placeholder component.",
  "frontend/src/components/site/ServicesSection.tsx": "Empty placeholder component.",
  "frontend/src/features/dashboard/DashboardPage.tsx": "Dashboard allowing users to pick a dataset, filter by date range, and view computed metrics with loading and empty states.",
  "frontend/src/features/datasets/DatasetDetailsPage.tsx": "Displays details for a selected dataset, computes derived metrics, and supports JSON export.",
  "frontend/src/features/datasets/DatasetsPage.tsx": "Lists all user datasets with basic info and provides navigation to dataset detail pages.",
  "frontend/src/features/import/ImportPage.tsx": "Handles file upload, parsing CSV/JSON smartwatch data, and saving new datasets.",
  "frontend/src/features/import/ImportPreviewTable.tsx": "Shows a tabular preview of parsed smartwatch records before import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for potential query hooks.",
  "frontend/src/hooks/useSmartwatchDatasets.ts": "React Query hooks for fetching, adding, and filtering smartwatch datasets and managing user profiles.",
  "frontend/src/index.css": "Defines Tailwind layers and a full light/dark OKLCH color system plus base typography styles.",
  "frontend/src/lib/smartwatch/analytics.ts": "Provides date‑range filtering and computes aggregated smartwatch metrics such as steps, heart rate, calories, and sleep.",
  "frontend/src/lib/smartwatch/exportJson.ts": "Converts a smartwatch dataset to a clean JSON export and triggers a file download.",
  "frontend/src/lib/smartwatch/fieldMapping.ts": "Maps various field name variants to normalized smartwatch metric keys.",
  "frontend/src/lib/smartwatch/importParsers.ts": "Parses smartwatch CSV/JSON data into normalized records with warnings and unmapped field tracking.",
  "frontend/src/lib/smartwatch/model.ts": "Defines TypeScript models for parsed smartwatch records, datasets, and parsing results.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, OKLCH color tokens, typography, and plugins.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable injection, path aliasing, build settings, and a dev proxy.",
  "project_state.json": "Holds the project’s current state, including schema info, image requirements, and a list of defined features with requirement IDs and versions."
}