{
  "kind": "build_request",
  "title": "Add a project gallery section to the Maa Sharada Construction website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add a new \"Project Gallery\" section to the single-page site to showcase completed construction projects using a responsive photo grid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Your update is live—would you like to add a project gallery next? yes"
        ]
      },
      "acceptanceCriteria": [
        "A new section is rendered on the homepage between Services and Contact (or another clearly intentional placement) and uses a stable section id (e.g., id=\"gallery\") so it can be navigated via scroll.",
        "The gallery displays at least 6 project images in a responsive grid (1 column on small screens, increasing on larger breakpoints).",
        "Clicking/tapping an image opens an in-page preview (modal/dialog or equivalent) with the larger image and a close control; ESC closes the preview.",
        "All images have meaningful alt text and do not break layout while loading (use fixed aspect ratio containers and object-fit).",
        "All gallery image src paths are relative and compatible with IC deployment (consistent with existing \"./assets/generated/...\" usage)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update site navigation (header and footer quick links) to include the new Project Gallery section and ensure smooth-scroll navigation works for it on desktop and mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Your update is live—would you like to add a project gallery next? yes"
        ]
      },
      "acceptanceCriteria": [
        "Header navigation includes a new item that scrolls smoothly to the gallery section and closes the mobile drawer after selection (matching existing behavior).",
        "Footer “Quick Links” includes a new link/button that scrolls smoothly to the gallery section (matching existing behavior).",
        "After navigation to the gallery, the section heading is not hidden behind the sticky header (existing scroll-margin behavior continues to apply)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure the new Project Gallery section matches the existing site theme (spacing, typography, card styles, and hover states) and looks good on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Your update is live—would you like to add a project gallery next? yes"
        ]
      },
      "acceptanceCriteria": [
        "Gallery section styling is consistent with the existing construction-themed design system (Tailwind tokens, border/shadow patterns similar to other sections).",
        "The section includes a clear heading and short description consistent with other sections’ structure and spacing.",
        "No regressions to existing sections (Hero, Services, Contact, Footer) and the page remains visually coherent end-to-end."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add third-party authentication providers; Internet Identity is the only supported auth mechanism (not required for this gallery).",
    "Keep the app deployable to the Internet Computer with relative asset paths (consistent with current \"./assets/...\" usage).",
    "Backend must remain a single Motoko actor; no new backend is required for a static gallery."
  ],
  "nonGoals": [
    "Do not build an admin panel or CMS for managing gallery items.",
    "Do not implement image uploads from the browser or store images on the backend.",
    "Do not add real-time features (e.g., websockets) or external databases.",
    "Do not change existing contact details, services content, or deployment workflow unless required for the gallery links/section placement."
  ],
  "imageRequirements": {
    "required": [
      "Construction project photo: newly built single-family house exterior in warm daylight (maa-sharada-gallery-01.dim_1200x800.png)",
      "Construction project photo: boundary wall construction with masonry detail (maa-sharada-gallery-02.dim_1200x800.png)",
      "Construction project photo: interior tiling work close-up with clean grout lines (maa-sharada-gallery-03.dim_1200x800.png)",
      "Construction project photo: door and window installation scene, modern finish (maa-sharada-gallery-04.dim_1200x800.png)",
      "Construction project photo: roof slab centering/shuttering work on site (maa-sharada-gallery-05.dim_1200x800.png)",
      "Construction project photo: electrical wiring installation in a residential interior (maa-sharada-gallery-06.dim_1200x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in build requests/specifications."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}